docs/posts/2017-12-09-ordination-prayer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ordination Prayer</title>
<meta name="author" content="Randall Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Ordination Prayer</h1>
<p class="subtitle" role="doc-subtitle">Dec 09, 2017</p>
</header><p>
<i>This is a prayer for an ordination service at NorthHaven Church on December 9, 2017</i>
</p>

<p>
God of grace and hope,
</p>

<p>
We confess that, sometimes,<br>
we are like Israel in Egypt,<br>
overwhelmed by life and<br>
tempted to believe that<br>
you have abandoned your people.
</p>

<p>
In this, though, we have hope,<br>
though Israel had forgotten you,<br>
you did not abandon her.<br>
Instead, you called Moses<br>
to be her minister.
</p>

<p>
And so, from the desert<br>
of our dry and parched lives,<br>
you continue to call —<br>
not from a burning bush,<br>
but from within,<br>
from a heart aflame<br>
with passion for<br>
the kingdom of God<br>
and for your people.
</p>

<p>
Today, we give thanks for Kim,<br>
a minister with such a heart,<br>
who, like Moses,<br>
has answered your call.
</p>

<p>
Grant her the vision<br>
to see things as they are,<br>
and the spiritual imagination<br>
to recognize what they could be.
</p>

<p>
May her laughter be joyful;<br>
her anger, righteous;<br>
her compassion, gentle;<br>
her witness, bold;<br>
and her love, deep.
</p>

<p>
Fill her with the<br>
power of the Almighty,<br>
who took what was<br>
formless and void<br>
and created the universe,<br>
then declared it good.
</p>

<p>
May her ministry<br>
be the means by which<br>
you continue to take<br>
what is broken and empty,<br>
and create that which is<br>
new, beautiful and good.
</p>

<p>
In the name of the Father<br>
who gives us our mission,<br>
and of the Son,<br>
whose obedience is our model,<br>
and of the Spirit,<br>
who gives us strength<br>
for our task.
</p>

<p>
Three persons,<br>
one God,<br>
forever and ever.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).
</div>
</footer>
</body>
</html>
